model {
  ssd {
    num_classes: 9
    image_resizer {
      fixed_shape_resizer {
        height: 224
        width: 224
      }
    }
    feature_extractor {
      type: "ssd_efficientnet"
      network_version: "efficientnet-b0"
      min_feature_level: 3
      max_feature_level: 7
      # additional_layer_depth: 256
      depth_multiplier: 1.0
      min_depth: 16
      conv_hyperparams {
        regularizer {
          l2_regularizer {
            weight: 0.00039999998989515007
          }
        }
        initializer {
          truncated_normal_initializer {
            mean: 0.0
            stddev: 0.029999999329447746
          }
        }
        activation: RELU_6
        batch_norm {
          decay: 0.996999979019165
          scale: true
          epsilon: 0.0010000000474974513
        }
      }
    }
    box_coder {
      faster_rcnn_box_coder {
        y_scale: 10.0
        x_scale: 10.0
        height_scale: 5.0
        width_scale: 5.0
      }
    }
    matcher {
      argmax_matcher {
        matched_threshold: 0.5
        unmatched_threshold: 0.5
        ignore_thresholds: false
        negatives_lower_than_unmatched: true
        force_match_for_each_row: true
        use_matmul_gather: true
      }
    }
    similarity_calculator {
      iou_similarity {
      }
    }
    box_predictor {
      convolutional_box_predictor {
        min_depth: 0
        max_depth: 0
        num_layers_before_predictor: 0
        use_dropout: false
        dropout_keep_probability: 0.8
        kernel_size: 1
        box_code_size: 4
        apply_sigmoid_to_scores: false
        conv_hyperparams {
          activation: RELU_6,
          regularizer {
            l2_regularizer {
              weight: 0.00004
            }
          }
          initializer {
            truncated_normal_initializer {
              stddev: 0.03
              mean: 0.0
            }
          }
          batch_norm {
            train: true,
            scale: true,
            center: true,
            decay: 0.9997,
            epsilon: 0.001,
          }
        }
      }
    }
    anchor_generator {
      multiscale_anchor_generator {
        min_level: 3
        max_level: 7
        anchor_scale: 2.0
        aspect_ratios: 1.0
        aspect_ratios: 2.0
        aspect_ratios: 0.5
        scales_per_octave: 4
      }
    }
    post_processing {
      batch_non_max_suppression {
        score_threshold: 9.99999993922529e-09
        iou_threshold: 0.6000000238418579
        max_detections_per_class: 100
        max_total_detections: 100
      }
      score_converter: SIGMOID
    }
    normalize_loss_by_num_matches: true
    normalize_loc_loss_by_codesize: true
    loss {
      localization_loss {
        weighted_smooth_l1 {
        }
      }
      classification_loss {
        weighted_sigmoid_focal {
          gamma: 2.0
          alpha: 0.25
        }
      }
      classification_weight: 1.0
      localization_weight: 1.0
    }
  }
}
train_config {
  batch_size: 2
  data_augmentation_options {
    random_horizontal_flip {
    }
  }
  data_augmentation_options {
    random_vertical_flip {
    }
  }
  sync_replicas: true
  optimizer {
    momentum_optimizer {
      learning_rate {
        cosine_decay_learning_rate {
          learning_rate_base: 0.003000000026077032
          total_steps: 100000
          warmup_learning_rate: 0.0013333000242710114
          warmup_steps: 2000
        }
      }
      momentum_optimizer_value: 0.8999999761581421
    }
  }
  fine_tune_checkpoint: "/content/gdrive/My Drive/RoadDamage/models/research/object_detection/models/checkpoints/efficientnet-b0/model.ckpt"
  from_detection_checkpoint: false
  num_steps: 100000
  startup_delay_steps: 0.0
  replicas_to_aggregate: 8
  max_number_of_boxes: 100
  unpad_groundtruth_tensors: false
}

train_input_reader: {
  tf_record_input_reader {
    input_path: "/content/gdrive/My Drive/RoadDamage/models/research/object_detection/data/road_damage_train.tfrecord"
  }
  label_map_path: "/content/gdrive/My Drive/RoadDamage/models/research/object_detection/data/road_damage.pbtxt"
}

eval_config {
  num_examples: 1000
  metrics_set: "coco_detection_metrics"
  use_moving_averages: false
  max_evals: 1 
}

eval_input_reader: {
  tf_record_input_reader {
    input_path: "/content/gdrive/My Drive/RoadDamage/models/research/object_detection/data/road_damage_eval.tfrecord"
  }
  label_map_path: "/content/gdrive/My Drive/RoadDamage/models/research/object_detection/data/road_damage.pbtxt"
  shuffle: false
  num_readers: 1
}
